In [1]:
import pandas as pd

In [2]:
s = pd.Series([10,20,30,40])

In [3]:
s.apply (lambda x : x *2 )

0    20
1    40
2    60
3    80
dtype: int64

In [4]:
df = pd.DataFrame({
    "A": [1, 2, 3],
    "B": [10, 20, 30]
})

In [5]:
df

   A   B
0  1  10
1  2  20
2  3  30

In [6]:
df.apply(lambda col : col.mean())

A     2.0
B    20.0
dtype: float64

In [10]:
df.apply(lambda row : row.sum(), axis=1)

0    11
1    22
2    33
dtype: int64

In [11]:
df = pd.DataFrame({
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35]
})

In [12]:
df

    Name  Age
0   John   25
1  Alice   30
2    Bob   35

In [13]:
def age_category(age):
    if age < 30:
        return 'Young'
    else:
        return 'Old'

In [14]:
df["Category"] = df["Age"].apply(age_category)

In [15]:
df

    Name  Age Category
0   John   25    Young
1  Alice   30      Old
2    Bob   35      Old

In [16]:
df = pd.DataFrame({
    "Heart_Rate": [98, 105, 120],
    "Oxygen": [96, 95, 92]
})

In [17]:
df

   Heart_Rate  Oxygen
0          98      96
1         105      95
2         120      92

In [18]:
def Risk(row):
    if row['Heart_Rate'] > 100 and row['Oxygen'] < 95:
        return 'High Risk'
    else:
        return 'Normal'

In [19]:
df['Risk_Level']= df.apply(Risk, axis=1)

In [20]:
df

   Heart_Rate  Oxygen Risk_Level
0          98      96     Normal
1         105      95     Normal
2         120      92  High Risk

In [21]:
df = pd.DataFrame({
    "Patient_ID": [101, 101, 102, 102],
    "Heart_Rate": [80, 90, 95, 100]
})

In [22]:
df

   Patient_ID  Heart_Rate
0         101          80
1         101          90
2         102          95
3         102         100

In [24]:
df.groupby('Patient_ID')["Heart_Rate"].apply(lambda x : x.max() - x.min())

Patient_ID
101    10
102     5
Name: Heart_Rate, dtype: int64